andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
#include "lcd_ui.h"
#include "stm32h7rsxx.h"
#include <stdint.h>

#if defined(__GNUC__)
#define LCD_UI_UNUSED __attribute__((unused))
#else
#define LCD_UI_UNUSED
#endif

#define REG32(addr) (*(volatile uint32_t *)(addr))

#define RCC_AHB5ENR_REG REG32(RCC_BASE + 0x134UL)
#define RCC_AHB4ENR_REG REG32(RCC_BASE + 0x140UL)
#define RCC_AHB5ENR_FMCEN (1UL << 4)

#define MPU_TYPE_REG REG32(0xE000ED90UL)
#define MPU_CTRL_REG REG32(0xE000ED94UL)
#define MPU_RNR_REG  REG32(0xE000ED98UL)
#define MPU_RBAR_REG REG32(0xE000ED9CUL)
#define MPU_RASR_REG REG32(0xE000EDA0UL)
#define SCB_SHCSR_REG REG32(0xE000ED24UL)

#define MPU_CTRL_ENABLE     (1UL << 0)
#define MPU_CTRL_PRIVDEFENA (1UL << 2)
#define MPU_RASR_XN         (1UL << 28)
#define MPU_RASR_AP_FULL    (3UL << 24)
#define MPU_RASR_S          (1UL << 18)
#define MPU_RASR_SIZE_64MB  (25UL << 1)
#define MPU_RASR_ENABLE     (1UL << 0)

#define FMC_Bank1_R_BASE  0x52004000UL
#define FMC_Bank1E_R_BASE 0x52004104UL

#define FMC_BCR1_FMCEN (1UL << 31)
#define FMC_BCRx_MBKEN (1UL << 0)
#define FMC_BCRx_MWID_16BIT (1UL << 4)
#define FMC_BCRx_WREN  (1UL << 12)
#define FMC_BCRx_EXTMOD (1UL << 14)
#define FMC_BCR1_CCLKEN (1UL << 20)

typedef struct {
    volatile uint32_t BTCR[8];
} FMC_Bank1_TypeDef;

typedef struct {
    volatile uint32_t BWTR[7];
} FMC_Bank1E_TypeDef;

#define FMC_Bank1_R  ((FMC_Bank1_TypeDef *)FMC_Bank1_R_BASE)
#define FMC_Bank1E_R ((FMC_Bank1E_TypeDef *)FMC_Bank1E_R_BASE)

typedef struct {
    volatile uint16_t LCD_REG;
    volatile uint16_t LCD_RAM;
} LCD_TypeDef;

#define LCD ((LCD_TypeDef *)0x6000FFFEUL)

#define LCD_W 240U
#define LCD_H 320U

#define LCD_CTRL_CS GPIO_PIN_12
#define LCD_CTRL_RD GPIO_PIN_5
#define LCD_CTRL_WR GPIO_PIN_2
#define LCD_CTRL_RS GPIO_PIN_10

#define TOUCH_PEN GPIO_PIN_4
#define TOUCH_SCK GPIO_PIN_12
#define TOUCH_MISO GPIO_PIN_13
#define TOUCH_MOSI GPIO_PIN_14
#define TOUCH_CS GPIO_PIN_15

#define KEY_WKUP GPIO_PIN_13
#define KEY0_PIN GPIO_PIN_9
#define KEY1_PIN GPIO_PIN_8
#define KEY2_PIN GPIO_PIN_7

#define LCD_DATA_MASK_A (GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_8 | \
                         GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_15)
#define LCD_DATA_MASK_B (GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_10 | \
                         GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13)

#define COLOR_BLACK   0x0000
#define COLOR_WHITE   0xFFFF
#define COLOR_BG      0xEF7D
#define COLOR_PANEL   0xFFFF
#define COLOR_HEADER  0x02B2
#define COLOR_BLUE    0x049F
#define COLOR_GREEN   0x07E0
#define COLOR_RED     0xF800
#define COLOR_YELLOW  0xFFE0
#define COLOR_GRAY    0x8410
#define COLOR_DARK    0x2104
#define COLOR_NAV     0x3186
#define COLOR_ORANGE  0xFC80
#define COLOR_TRACK   0xC618
#define COLOR_ACCENT  0x06FF

#define TOUCH_RAW_MIN 200U
#define TOUCH_RAW_MAX 3900U
#define TOUCH_SWAP_XY 1U
#define TOUCH_INV_X   1U
#define TOUCH_INV_Y   0U
#define TOUCH_DIAG_MODE 0U

static uint16_t g_lcd_id;
static UI_Data_t g_ui_data = {
    72, 98, 365, 2, -1, 0, 1, 126, 0, 0, 1
};
static uint8_t g_current_page;
static uint8_t g_needs_redraw = 1;
static uint8_t g_key_ready = 1;

static void LCD_UI_UNUSED lcd_mpu_init(void)
{
    if ((MPU_TYPE_REG & 0xFFUL) == 0U) {
        return;
    }

    __asm volatile("dsb");
    __asm volatile("isb");
    MPU_CTRL_REG = 0;

    MPU_RNR_REG = 0;
    MPU_RBAR_REG = 0x60000000UL;
    MPU_RASR_REG = MPU_RASR_XN | MPU_RASR_AP_FULL | MPU_RASR_S |
                   MPU_RASR_SIZE_64MB | MPU_RASR_ENABLE;

    SCB_SHCSR_REG |= (1UL << 16);
    MPU_CTRL_REG = MPU_CTRL_PRIVDEFENA | MPU_CTRL_ENABLE;
    __asm volatile("dsb");
    __asm volatile("isb");
}

static void delay_cycles(volatile uint32_t cycles)
{
    while (cycles--) {
        __asm volatile("nop");
    }
}

static void delay_ms(uint32_t ms)
{
    while (ms--) {
        delay_cycles(12000);
    }
}

static void LCD_UI_UNUSED gpio_pin_af(GPIO_TypeDef *gpio, uint32_t pin, uint32_t af)
{
    uint32_t shift = pin * 2U;
    gpio->MODER = (gpio->MODER & ~(3UL << shift)) | (GPIO_MODER_ALT << shift);
    gpio->OTYPER &= ~(1UL << pin);
    gpio->OSPEEDR = (gpio->OSPEEDR & ~(3UL << shift)) | (GPIO_OSPEEDR_VERY_HIGH << shift);
    gpio->PUPDR = (gpio->PUPDR & ~(3UL << shift)) | (GPIO_PUPDR_PULLUP << shift);

    uint32_t afr_index = pin >> 3U;
    uint32_t afr_shift = (pin & 7U) * 4U;
    gpio->AFR[afr_index] = (gpio->AFR[afr_index] & ~(0xFUL << afr_shift)) | (af << afr_shift);
}

static void gpio_pin_output(GPIO_TypeDef *gpio, uint32_t pin)
{
    uint32_t shift = pin * 2U;
    gpio->MODER = (gpio->MODER & ~(3UL << shift)) | (GPIO_MODER_OUTPUT << shift);
    gpio->OTYPER &= ~(1UL << pin);
    gpio->OSPEEDR = (gpio->OSPEEDR & ~(3UL << shift)) | (GPIO_OSPEEDR_HIGH << shift);
    gpio->PUPDR &= ~(3UL << shift);
}

static void gpio_pin_input_pullup(GPIO_TypeDef *gpio, uint32_t pin)
{
    uint32_t shift = pin * 2U;
    gpio->MODER &= ~(3UL << shift);
    gpio->PUPDR = (gpio->PUPDR & ~(3UL << shift)) | (GPIO_PUPDR_PULLUP << shift);
}

static void gpio_pin_input_pulldown(GPIO_TypeDef *gpio, uint32_t pin)
{
    uint32_t shift = pin * 2U;
    gpio->MODER &= ~(3UL << shift);
    gpio->PUPDR = (gpio->PUPDR & ~(3UL << shift)) | (GPIO_PUPDR_PULLDOWN << shift);
}

static void lcd_bus_init(void)
{
    RCC_AHB4ENR_REG |= RCC_AHB4ENR_GPIOAEN | RCC_AHB4ENR_GPIOBEN |
                       RCC_AHB4ENR_GPIOCEN | RCC_AHB4ENR_GPIODEN |
                       RCC_AHB4ENR_GPIOEEN;
    (void)RCC_AHB4ENR_REG;

    gpio_pin_output(GPIOA, 0);
    gpio_pin_output(GPIOA, 1);
    gpio_pin_output(GPIOA, 2);
    gpio_pin_output(GPIOA, 5);
    gpio_pin_output(GPIOA, 8);
    gpio_pin_output(GPIOA, 9);
    gpio_pin_output(GPIOA, 10);
    gpio_pin_output(GPIOA, 11);
    gpio_pin_output(GPIOA, 12);
    gpio_pin_output(GPIOA, 15);

    gpio_pin_output(GPIOB, 2);
    gpio_pin_output(GPIOB, 3);
    gpio_pin_output(GPIOB, 4);
    gpio_pin_output(GPIOB, 5);
    gpio_pin_output(GPIOB, 10);
    gpio_pin_output(GPIOB, 11);
    gpio_pin_output(GPIOB, 12);
    gpio_pin_output(GPIOB, 13);

    gpio_pin_output(GPIOD, 12);
    gpio_pin_output(GPIOE, 10);
    gpio_pin_output(GPIOD, 15);
    gpio_pin_output(GPIOD, 14);
    gpio_pin_output(GPIOC, 0);

    gpio_pin_input_pullup(GPIOD, 4);
    gpio_pin_output(GPIOE, 12);
    gpio_pin_input_pullup(GPIOE, 13);
    gpio_pin_output(GPIOE, 14);
    gpio_pin_output(GPIOE, 15);
    gpio_pin_input_pulldown(GPIOC, 13);
    gpio_pin_input_pullup(GPIOE, 7);
    gpio_pin_input_pullup(GPIOE, 8);
    gpio_pin_input_pullup(GPIOE, 9);

    GPIOD->BSRR = GPIO_PIN_15 | LCD_CTRL_CS;
    GPIOA->BSRR = LCD_CTRL_RD;
    GPIOB->BSRR = LCD_CTRL_WR;
    GPIOE->BSRR = LCD_CTRL_RS;
    GPIOD->BSRR = (uint32_t)LCD_CTRL_CS << 16;
    GPIOE->BSRR = TOUCH_CS;
    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
    GPIOE->BSRR = (uint32_t)TOUCH_MOSI << 16;
}

static void lcd_gpio_write_bus(uint16_t data)
{
    uint32_t porta =
        ((data & 0x0001U) << 12) |
        ((data & 0x0002U) << 10) |
        ((data & 0x0004U) << 8) |
        ((data & 0x0008U) << 6) |
        ((data & 0x0010U) << 4) |
        ((data & 0x0020U) >> 3) |
        ((data & 0x0040U) >> 5) |
        ((data & 0x0080U) >> 7) |
        ((data & 0x8000U) << 0);
    uint32_t portb =
        ((data & 0x0100U) << 5) |
        ((data & 0x0200U) << 3) |
        ((data & 0x0400U) << 1) |
        ((data & 0x0800U) >> 1) |
        ((data & 0x1000U) >> 7) |
        ((data & 0x2000U) >> 9) |
        ((data & 0x4000U) >> 11);

    GPIOA->ODR = (GPIOA->ODR & ~LCD_DATA_MASK_A) | porta;
    GPIOB->ODR = (GPIOB->ODR & ~LCD_DATA_MASK_B) | portb;
}

static void lcd_gpio_write(uint16_t value, uint8_t is_data)
{
    if (is_data) {
        GPIOE->BSRR = LCD_CTRL_RS;
    } else {
        GPIOE->BSRR = (uint32_t)LCD_CTRL_RS << 16;
    }

