andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
static void draw_alert(void)
{
    draw_header("ALERT AND DATA");
    draw_panel(8, 38, 224, 58, COLOR_PANEL);
    draw_status_dot(20, 52, g_ui_data.alarm_active ? COLOR_RED : COLOR_GREEN);
    draw_text(42, 50, "ALARM STATE", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(42, 72, g_ui_data.alarm_active ? "ACTIVE" : "CLEAR", g_ui_data.alarm_active ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 106, 224, 58, COLOR_PANEL);
    draw_text(20, 118, "WATCH ITEMS", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 140, "FALL HR SPO2 PILL", COLOR_BLUE, COLOR_PANEL, 1);

    draw_panel(8, 174, 224, 58, COLOR_PANEL);
    draw_text(20, 186, "CAPTURE PORT", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(20, 208, "A5 VER DATA SUM", COLOR_BLUE, COLOR_PANEL, 1);

    draw_panel(8, 242, 224, 34, COLOR_PANEL);
    draw_text(20, 254, "UART WIFI READY", COLOR_GREEN, COLOR_PANEL, 1);
    draw_nav();
}

static void draw_page(void)
{
    switch (g_current_page) {
        case 1: draw_health(); break;
        case 2: draw_pill(); break;
        case 3: draw_alert(); break;
        default: draw_home(); break;
    }
    g_needs_redraw = 0;
}

static void touch_write_byte(uint8_t data)
{
    for (uint8_t i = 0; i < 8U; i++) {
        if (data & 0x80U) {
            GPIOE->BSRR = TOUCH_MOSI;
        } else {
            GPIOE->BSRR = (uint32_t)TOUCH_MOSI << 16;
        }

        data <<= 1;
        GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
        delay_cycles(80);
        GPIOE->BSRR = TOUCH_SCK;
        delay_cycles(80);
    }
}

static uint16_t touch_read_ad(uint8_t cmd)
{
    uint16_t value = 0;

    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
    GPIOE->BSRR = (uint32_t)TOUCH_MOSI << 16;
    GPIOE->BSRR = (uint32_t)TOUCH_CS << 16;
    touch_write_byte(cmd);
    delay_cycles(400);

    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
    delay_cycles(80);
    GPIOE->BSRR = TOUCH_SCK;
    delay_cycles(80);
    GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;

    for (uint8_t i = 0; i < 16U; i++) {
        value <<= 1;
        GPIOE->BSRR = (uint32_t)TOUCH_SCK << 16;
        delay_cycles(80);
        GPIOE->BSRR = TOUCH_SCK;
        if (GPIOE->IDR & TOUCH_MISO) {
            value++;
        }
        delay_cycles(80);
    }

    GPIOE->BSRR = TOUCH_CS;
    return (uint16_t)(value >> 4);
}

static uint16_t touch_read_filtered(uint8_t cmd)
{
    uint16_t min = 0xFFFF;
    uint16_t max = 0;
    uint32_t sum = 0;

    for (uint8_t i = 0; i < 5U; i++) {
        uint16_t v = touch_read_ad(cmd);
        if (v < min) min = v;
        if (v > max) max = v;
        sum += v;
    }

    return (uint16_t)((sum - min - max) / 3U);
}

static uint8_t touch_is_down(void)
{
    return (GPIOD->IDR & TOUCH_PEN) == 0U;
}

static uint8_t touch_read_raw(uint16_t *x, uint16_t *y)
{
    if (!touch_is_down()) {
        return 0;
    }

    *x = touch_read_filtered(0xD0);
    *y = touch_read_filtered(0x90);
    return touch_is_down();
}

static uint16_t clamp_map(uint16_t raw, uint16_t out_max, uint8_t invert)
{
    uint32_t value;

    if (raw < TOUCH_RAW_MIN) raw = TOUCH_RAW_MIN;
    if (raw > TOUCH_RAW_MAX) raw = TOUCH_RAW_MAX;
    value = ((uint32_t)(raw - TOUCH_RAW_MIN) * out_max) / (TOUCH_RAW_MAX - TOUCH_RAW_MIN);
    if (invert) value = out_max - value;
    return (uint16_t)value;
}

static uint8_t LCD_UI_UNUSED touch_read_screen(uint16_t *x, uint16_t *y)
{
    uint16_t raw_x;
    uint16_t raw_y;
    uint16_t sx;
    uint16_t sy;

    if (!touch_read_raw(&raw_x, &raw_y)) {
        return 0;
    }

#if TOUCH_SWAP_XY
    sx = clamp_map(raw_y, LCD_W - 1U, TOUCH_INV_X);
    sy = clamp_map(raw_x, LCD_H - 1U, TOUCH_INV_Y);
#else
    sx = clamp_map(raw_x, LCD_W - 1U, TOUCH_INV_X);
    sy = clamp_map(raw_y, LCD_H - 1U, TOUCH_INV_Y);
#endif

    *x = sx;
    *y = sy;
    return 1;
}

static uint8_t LCD_UI_UNUSED touch_read_diag(uint16_t *raw_x, uint16_t *raw_y, uint16_t *sx, uint16_t *sy)
{
    if (!touch_read_raw(raw_x, raw_y)) {
        return 0;
    }

#if TOUCH_SWAP_XY
    *sx = clamp_map(*raw_y, LCD_W - 1U, TOUCH_INV_X);
    *sy = clamp_map(*raw_x, LCD_H - 1U, TOUCH_INV_Y);
#else
    *sx = clamp_map(*raw_x, LCD_W - 1U, TOUCH_INV_X);
    *sy = clamp_map(*raw_y, LCD_H - 1U, TOUCH_INV_Y);
#endif
    return 1;
}

static void LCD_UI_UNUSED draw_touch_diag(uint8_t down, uint16_t raw_x, uint16_t raw_y, uint16_t sx, uint16_t sy)
{
    lcd_fill(0, 0, LCD_W, LCD_H, COLOR_BG);
    lcd_fill(0, 0, LCD_W, 30, COLOR_HEADER);
    draw_text(8, 8, "TOUCH TEST", COLOR_WHITE, COLOR_HEADER, 2);

    draw_panel(8, 42, 224, 76, COLOR_PANEL);
    draw_text(20, 54, down ? "PEN DOWN" : "PEN UP", down ? COLOR_GREEN : COLOR_RED, COLOR_PANEL, 2);
    draw_text(20, 86, "HOLD AND MOVE", COLOR_DARK, COLOR_PANEL, 1);

    draw_panel(8, 128, 224, 84, COLOR_PANEL);
    draw_text(20, 140, "RAW X", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(82, 136, raw_x, COLOR_BLUE, COLOR_PANEL, 2);
    draw_text(20, 172, "RAW Y", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(82, 168, raw_y, COLOR_BLUE, COLOR_PANEL, 2);

    draw_panel(8, 222, 224, 82, COLOR_PANEL);
    draw_text(20, 234, "MAP X", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(82, 230, sx, COLOR_ORANGE, COLOR_PANEL, 2);
    draw_text(20, 266, "MAP Y", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(82, 262, sy, COLOR_ORANGE, COLOR_PANEL, 2);
}

static uint8_t key_scan(void)
{
    uint8_t key = 0;
    uint8_t wkup_pressed = (GPIOC->IDR & KEY_WKUP) != 0U;
    uint8_t key0_pressed = (GPIOE->IDR & KEY0_PIN) == 0U;
    uint8_t key1_pressed = (GPIOE->IDR & KEY1_PIN) == 0U;
    uint8_t key2_pressed = (GPIOE->IDR & KEY2_PIN) == 0U;

    if (g_key_ready && (wkup_pressed || key0_pressed || key1_pressed || key2_pressed)) {
        delay_ms(12);
        g_key_ready = 0;

        if ((GPIOE->IDR & KEY2_PIN) == 0U) key = 3;
        if ((GPIOE->IDR & KEY1_PIN) == 0U) key = 2;
        if ((GPIOE->IDR & KEY0_PIN) == 0U) key = 1;
        if ((GPIOC->IDR & KEY_WKUP) != 0U) key = 4;
    } else if (!wkup_pressed && !key0_pressed && !key1_pressed && !key2_pressed) {
        g_key_ready = 1;
    }

    return key;
}

static void UI_OnKey(uint8_t key)
{
    if (key == 0U) {
        return;
    }

    g_current_page = (uint8_t)(key - 1U);
    if (g_current_page > 3U) {
        g_current_page = 3U;
    }
    g_needs_redraw = 1;
}

void UI_OnTouch(uint16_t x, uint16_t y, uint8_t pressed)
{
    if (!pressed) {
        return;
    }

    if (y >= 286U) {
        g_current_page = (uint8_t)(x / 60U);
        if (g_current_page > 3U) g_current_page = 3U;
        g_needs_redraw = 1;
        return;
    }

    if (g_current_page == 0U) {
        if (y >= 38U && y <= 108U) {
            if (x < 120U) g_current_page = 1U;
            else g_current_page = 1U;
            g_needs_redraw = 1;
            return;
        }

