andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
        if (y >= 116U && y <= 174U) {
            g_current_page = 2U;
            g_needs_redraw = 1;
            return;
        }

        if (y >= 182U && y <= 274U) {
            g_current_page = 3U;
            g_needs_redraw = 1;
        }
    } else if (y < 34U) {
        g_current_page = 0U;
        g_needs_redraw = 1;
    }
}

void UI_Update(const UI_Data_t *data)
{
    if (!data) {
        return;
    }

    g_ui_data = *data;
    g_needs_redraw = 1;
}

uint16_t UI_GetCaptureFrame(uint8_t *buffer, uint16_t buffer_size)
{
    UI_CaptureFrame_t frame;
    const uint8_t *p;
    uint8_t sum = 0;

    if (!buffer || buffer_size < sizeof(frame)) {
        return 0;
    }

    frame.magic = 0xA5;
    frame.version = 1;
    frame.data = g_ui_data;
    frame.checksum = 0;
    p = (const uint8_t *)&frame;
    for (uint16_t i = 0; i < sizeof(frame) - 1U; i++) {
        sum = (uint8_t)(sum + p[i]);
    }
    frame.checksum = sum;

    p = (const uint8_t *)&frame;
    for (uint16_t i = 0; i < sizeof(frame); i++) {
        buffer[i] = p[i];
    }

    return (uint16_t)sizeof(frame);
}

void UI_Init(void)
{
    lcd_bus_init();
    delay_ms(50);

    g_lcd_id = 0x9341;
    lcd_ili9341_init();
    GPIOD->BSRR = GPIO_PIN_15;

    g_current_page = 0;
    g_key_ready = 1;
    g_needs_redraw = 1;
    draw_page();
}

void UI_FirmwareRun(void)
{
    UI_Init();

    while (1) {
#if TOUCH_DIAG_MODE
        uint16_t raw_x = 0;
        uint16_t raw_y = 0;
        uint16_t sx = 0;
        uint16_t sy = 0;
        uint8_t pressed = touch_read_diag(&raw_x, &raw_y, &sx, &sy);
        draw_touch_diag(pressed, raw_x, raw_y, sx, sy);
        delay_ms(120);
#else
        UI_OnKey(key_scan());

        if (g_needs_redraw) {
            draw_page();
        }

        GPIOD->BSRR = (uint32_t)GPIO_PIN_14 << 16;
        GPIOC->BSRR = GPIO_PIN_0;
        delay_ms(80);
        GPIOD->BSRR = GPIO_PIN_14;
        GPIOC->BSRR = (uint32_t)GPIO_PIN_0 << 16;
        delay_ms(80);
#endif
    }
}
